# 집합 자료형
# s1 =set([1,2,3])
# print(s1)  1,2,3
# s2 = set("hello")
# print(s2)    'e', 'o', 'l', 'h'
# 특징 
# 1. 중복을 허용하지 않는다
# 2. 순서가 없다(순서가 없기 때문에 인덱싱을 하려면 리스트나 튜플로 바꾸어야 함)
# ex) s1 = set([1,2,3])
# l1 = list(s1)
# print(l1)  [1,2,3]
# print(l1(0))  1
# t1 = tuple(s1)
# print(t1)  (1,2,3)
# print(t1[0])  1
# 교집합 구하기
# s1 = set([1,2,3,4,5,6])
# s2 = set([4,5,6,7,8,9])
# print(s1 & s2)    {4, 5, 6}
# 합집합
# print(s1 | s2)  {1, 2, 3, 4, 5, 6, 7, 8, 9}
# 차집합
# print(s1 - s2)  {1, 2, 3}
# print(s2 - s1)  {8, 9, 7}
# 집합 자료형 값 1개 추가하기(.add)
# s1 = set([1,2,3])
# s1.add(4)
# print(s1)  {1, 2, 3, 4}
# 여러개 추가하기(.update)
# s1.update([4,5,6])
# print(s1)   {1, 2, 3, 4, 5, 6}
# 특정 값 제거하기(.remove)
# s1.remove(2)
# print(s1)   {1, 3}